cv.tex
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fa_orgmode_cv}
\author{rigidus}
\date{\today}
\title{Mikhail Glukhov - Common Lisp Developer}
\hypersetup{
 pdfauthor={rigidus},
 pdftitle={Mikhail Glukhov - Common Lisp Developer},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)},
 pdflang={English}}
\begin{document}

\maketitle
\begin{itemize}
\item A software architect with a solid technical background and
blockchain experience.
\item Experience: 16,5 years
\item Male, 38 years, was born 15th of December 1982
\item Computer Science Interests: programming language design,
compilers, virtual machines and distributed systems.
\item Keywords: Common Lisp, Blockchain, Go, Forth, Erlang, C,
С++, Tkl/Tk, Assembler x86, Assembler AVR | Nginx,
RabbitMQ, PostgreSQL
\end{itemize}

\begin{center}
\begin{tabular}{rl}
Blog: & \url{http://rigidus.ru}\\
Email: & \href{mailto:xxx@gmail.com}{avenger-f@yandex.ru, i.am.rigidus@gmail.com}\\
Github: & \url{https://github.com/rigidus}\\
\end{tabular}
\end{center}

\section{\textbf{Solution Architect} at \textbf{Insolar} [Jan 2020 - Jan 2021]}
\label{sec:org303daa0}

Enterprise blockchain startup
(\url{https://insolar.io}). Technology stack: Go + React

Insolar's architecture is complex, I needed to make sure I
understood all aspects.

[1] To visualize the algorithm of the Node's work, I wrote a
translator from the Go code to the State Diagram for
PlantUML. This state machine processed messages from other
nodes. I have applied my experience in building compilers.

As a result:
\begin{itemize}
\item Some bugs were found,
\item The documentation has become easier to keep up to date,
\item Accelerated architectural design: it was easier to reflect
the changes on the diagram,
\item I made sure that I understand architecture correctly.
\end{itemize}

[2] I have done architectural design for the Observer
component. It is a service that collects data from the
blockchain network, aggregates it and provides it to web
frontends. Frontends show our users transactions, account
balances, and contract states.

[3] For a startup, a patent portfolio is important - it
affects the price of the possible sale of the company and
the receipt of financing. I have patented architecture with
a US patent attorney and have filed several patents:
\begin{itemize}
\item US 62/966, 610 System and method for managing the
execution of domain smart contracts in Distributed
Ledger Technology networks
\item US 62/901, 388 Multi-purpose node model to provide
scalability in the blockchain application network.
\item US 62/937, 881 Systems and methods of extensible smart
contracts in Distributed Ledger Technology
\item US 62/878, 833 System and method of extensible
cryptography in a Distributed Ledger
\item US 62/924, 245 Systems and methods for achieving
consensus in a Decentralized Network
\item 040279.00001 Certified Record Book
\end{itemize}

\section{\textbf{Independent Research} [Apr 2019 - Dec 2019]}
\label{sec:org869c9d7}

Independently designed and implemented my own blockchain
system in Forth and Common Lisp aimed to Internet Of Things

\section{\textbf{Blockchain researcher} at \textbf{Waves} [Sep 2018 — Dec 2019]}
\label{sec:org630be52}

Waves (\url{https://waves.tech/}) is an open blockchain protocol
and development toolset for Web 3.0 applications and
decentralized solutions.

The company is the largest developer of blockchain solutions
in Russia

The blockchain is written in Scala, the frontends are ModX,
React, React Native.

Achievements:
\begin{itemize}
\item Developed a decompiler for Ride, the smart contract language
on the Waves blockchain. It finds compilation patterns
from bytecode and restores lost semantic constructs.
\item I researched the possibilities of implementing NFT tokens
and Curated List Registries on Waves blockchain.
\item I wrote a number of tests and documentation, you can see
my contribution on the github, because Waves is a
completely open source project (in Scala).
\end{itemize}

\section{\textbf{System Architect} at \textbf{Enecuum} [Mar 2017 - Sep 2018]}
\label{sec:orge99605c}

A startup in the post-ICO stage (\url{https://enecuum.com/}), is
developing a blockchain project. Technology stack: Java,
C++, Web, Mobile

I was hired for as System Architect, for can implement the
Virtual Machine for execution smart contract for
decentralized network nodes.

In practice, I had to deal with architecture design, hiring
and training team developers, setting and monitoring the
execution of tasks and many other things besides working
with code - this is, in general, normal for startups.

I divided the efforts of the developers by creating four
departments:
\begin{itemize}
\item Node developers
\item Block explorer developers
\item Mobile application developers
\item Web developers
\end{itemize}

Each department had 6-8 people and 2-3 testers, about 40
people in total. I implemented scrum and wrote several
utilities (in Emacs-Lisp) that track the progress of tasks
and signal when they are behind schedule. For each
department, I made a Gantt chart.

As a result, the project was completed on time. We finished
three days before the presentation in Hong Kong.

Solution characteristics:
\begin{itemize}
\item Scalable system of interacting nodes in a distributed
network (about 400 nodes)
\item Constant traffic at the level of 500-1000 transactions per
day on the test network
\item Smart contacts execution system
\item Compiler from JS-like language to Forth-like bytecode
\item Trained team leaders in each department
\end{itemize}

By agreement with the CEO and CTO, after the launch of
TestNet, I developed the Virtual Machine for executing smart
contracts.

Achievements:
\begin{itemize}
\item Launched the Test Network
\item Developed a virtual machine that executes smart contracts
\item Made a compiler from JS-like high-level language into
VM-bytecode.
\end{itemize}

\section{\textbf{TeamLead} at \textbf{Automaton} [Dec 2015 - Mar 2017]}
\label{sec:org446d82e}

The company is engaged in the development and operation of
automated parking lots.

I led a research project to develop a new hardware and
software parking system.

Technologies:
\begin{itemize}
\item PCB Design - Kikad, Altium Designer
\item Programming: C/С++, Assembler, Erlang (telephony), PHP/JS:
Symfony + React (web interface), EmacsLisp - code
generation for ``executable specifications'' and utilities
for collaborative remote work in a team
\item Architectural stack - Linux on ARM Cortex A8 and
Symphony + React in the control interface.
\end{itemize}

The development was carried out from scratch, in stages:
\begin{itemize}
\item Hiring employees
\item Selection of electronic components,
\item Creation of printed circuit boards,
\item Writing low-level code that controls barriers and polls
sensors
\item Writing business logic and web interfaces through which
parking can be controlled remotely,
\item Internet telephony connection to communicate with the
parking client
\end{itemize}

In total, 50-60 people worked on the project (excluding the
commercial department, which found clients and concluded
contracts):

The first implementation took place six months after the
start of development, the development fully paid off in a
year. The developed solution is ahead of the competitors.
\begin{itemize}
\item 2 design engineers (topologists) for the design of printed
circuit boards
\item 1 Linux kernel driver developer
\item 3 full stack web developers (PHP Symphony React)
\item 2 android developers
\item 1 ios developer
\item 4 QA specialists
\item 10-20 implementation engineers, installers, electricians
(at the implementation stage)
\item 1 3D modeler
\item 1 Erlang developer (telephony)
\item 10-15 pickers-pickers of the parent company (they assembled according to design documentation)
\item 1 TeamLead, he is also the technical project manager (it
was me)
\end{itemize}

My achievements:

\begin{itemize}
\item Designed the hardware and software architecture of the
paid parking automation system.
\item Planned and organized software and hardware development
work, including selection of electronic components and
circuit design.
\item Implemented business logic and presentation layer
(Operator Workplace) on Symfony and React
\item Supervised the implementation of the transport layer and
the hardware abstraction layer (C/C++, kernel modules,
device drivers)
\item Organized parallel development on a modular basis to speed
up product creation and kanban methodology
\item Implemented Continuous Integration and Lifecycle
Management Process (Releases, Bug Fixes, Feature
Additions, Technical Quality Control, Automated Testing)
\item Implemented secure (digital signature) and fail-safe
(rollback to the previous version if tests fail) firmware
update via the Internet.
\item Automated documentation generation and storage using GIT
based versioning and ``executable specifications''.
\end{itemize}

\section{\textbf{TeamLead} at \textbf{BKN} [Apr 2015 - Dec 2015]}
\label{sec:org5a7d992}

The company is the second local real estate website after
the Real Estate Bulletin (\url{https://bn.ru}). Receives income
from advertising on the site and ads from the sale of real
estate.

Supervised the development and promotion of information
technology for real estate agencies (b2b and b2c).

Technology stack: C \# and ASP.NET, ExtJs, 3 people were
involved in development.

The site showed a decline in ad revenue for the six months
before I joined the company. It was necessary to increase
the resource in the subject and interest advertisers.

Achievements:

\begin{itemize}
\item Using the data of real estate agencies, I created a
section on residential complexes and new buildings, which
soon reached 60\% of the site in volume, which allows you
to dramatically increase advertising revenues on.
\item Implemented on the site a section for the search and
selection of apartments, rooms and residential buildings
of the primary and secondary market, integrated it with
the inter-agency database of real estate objects.
\item Formed an SEO strategy for website development.
\end{itemize}

After the completion of the work, advertising revenue and
traffic began to show steady growth.


\section{\textbf{TeamLead} at \textbf{Trend} [Feb 2014 - Mar 2015]}
\label{sec:org35816d1}

The company (\url{https://trendrealty.ru}) is a young fast-growing
real estate agency specializing in the primary market (new
buildings). Technology stack: Php, Nginx, Mysql, PostgreSql

Prior to my arrival, real estate agents used skype and
google docs to synchronize information with each other and
receive data from developers. Given the rapid growth, this
was becoming a bottleneck.

Achievements:

Automated the business process of a real estate sales agency
(new buildings):
\begin{itemize}
\item Made an internal portal with a personal account of a
realtor and the functionality of booking apartments
\item Implemented automated setting of recommended prices and
automatic selection of an object according to the criteria
entered by the realtor
\end{itemize}


\section{\textbf{Lisp|Erlang Developer} at \textbf{Algorithmic Trading Company} [Apr 2012 - Feb 2014]}
\label{sec:orgd32c8ec}

I have developed solutions in the field of electronic
currencies based on BlockChain technology. (\url{https://aintsys.com})

Technology stack: Erlang, Common Lisp, C ++

Unfortunately, under the terms of the NDA, I have no right
to disseminate information about the activities of the
company and my developments on the network :(

\section{\textbf{Senior Developer} at \textbf{WizardSoft} [May 2011 - Apr 2012]}
\label{sec:orgc4efb07}

The company (\url{https://wizardsoft.ru}) is engaged in the
automation of cost management in construction.

Achievements:

Developed a high-load portal for construction tenders. The
prototype was implemented in Common Lisp, Postmodern and
PostgreSQL. After acceptance, the prototype was
significantly extended and rewritten in PHP

\section{\textbf{Middle developer} at \textbf{TsiFri} [Sep 2009 - Apr 2011]}
\label{sec:orgab25f2c}

The company (\url{http://320-8080.ru}) is an online store of
digital technology.

Technology stack: PHP, MySql, Jquery, Common Lisp, Memcached

Achievements:

\begin{itemize}
\item At the first stage, in the shortest possible time, I
prepared the legacy code for the New Year loads by
introducing caching.
\item Then I completely redesigned and implemented it for a
high-load online store.
\end{itemize}

\section{\textbf{Junior Web Developer} at \textbf{Webdom} [Jan 2007 - Sep 2009]}
\label{sec:org3e8283d}

Web Studio (\url{https://webdom.net})

Technology stack: Php, Nginx, MySql

Achievements:

\begin{itemize}
\item Developed the framework on which the company now
operates. CMS based on it are delivered to clients.
\end{itemize}

\section{\textbf{Freelance programmer} at \textbf{Pochin} [Sep 2005 - Jan 2007]}
\label{sec:org4346add}

The company (\url{http://pochin.ru}) is an online store of car
covers, auto parts and auto tools.

Technology stack: Linux, Apache, MySQL, PHP

Initially started as a freelance programmer, but soon the
collaboration became permanent.

Achievements:

\begin{itemize}
\item Designed and developed an online store (three versions in
a year and a half)
\end{itemize}
\end{document}
